In [2]:
import mysql.connector as dbs #importing database

database = dbs.connect(
    host="localhost",
    user="root",
    password="",
    database = "pythonclass2pm"
)
db = database.cursor()

In [3]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 78, 67, 90, 87, 80, 400, 80.0, 'A')
(2, 'Shyam', 80, 77, 90, 87, 80, 420, 84.0, 'A')
(3, 'Nabin', 78, 89, 78, 67, 80, 440, 84.0, 'A')
(4, 'Nabina', 78, 89, 78, 67, 80, 440, 84.0, 'A')

In [7]:
db.execute("SELECT * FROM student WHERE name = 'ram' ")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 78, 67, 90, 87, 80, 400, 80.0, 'A')

In [13]:
db.execute("SELECT * FROM student WHERE name = 'Ram' or per < 84.0 ")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 78, 67, 90, 87, 80, 400, 80.0, 'A')

In [14]:
sql = '''INSERT INTO student(sn,name,physics,chemistry,math,english,nepali,total, per,grade)
VALUES (6,'Hari',70,90,87,60,89,400,80,'A')'''
db.execute(sql)
database.commit()

In [ ]:
sql = '''INSERT INTO student(sn,name,physics,chemistry,math,english,nepali,total, per,grade)
VALUES (,'Hari',70,90,87,60,89,400,80,'A')'''
db.execute(sql)
database.commit()

In [ ]:
# # WAP to insert data in database takeing data from user
# Update
# Delete